TutoElectroWeb/STM32_SGP40/STM32_SGP40.c
/**
  ******************************************************************************
  * @file    STM32_SGP40.c
  * @brief   Implémentation driver STM32 HAL pour capteur VOC SGP40 (Sensirion)
  * @author  Generated via STM32_LIB_STYLE_GUIDE.md
  * @date    2026-02-11
  * @version 0.9.0
  * @copyright Libre sous licence MIT.
  ******************************************************************************
  */

#include "STM32_SGP40.h"
#include "sensirion_gas_index_algorithm.h"  ///< Header vendor — inclus ici uniquement, pas dans le .h public
#include <math.h>
#include <string.h>

/* ============================================================================
 * Private defines
 * ============================================================================ */
#define SGP40_SERIAL_SIZE       9       ///< Serial: 3 words (2 bytes + CRC chaque)
#define SGP40_TEST_OK_VALUE     0xD400U ///< Valeur attendue auto-test (datasheet §5.2 : octet bas toujours 0x00)
#define SGP40_TEST_FAIL_VALUE   0x4B00U ///< Valeur échec auto-test (datasheet §5.2)

/** @brief Accès typé au buffer opaque algo VOC dans un handle SGP40.
 *  Évite l'exposition de GasIndexAlgorithmParams dans le .h public.
 */
#define SGP40_VOC_ALGO(h) ((GasIndexAlgorithmParams *)(void *)((h)->_voc_algo_opaque))

/* Vérifie à la compilation que SGP40_VOC_ALGO_OPAQUE_SIZE == sizeof(GasIndexAlgorithmParams).
 * En cas d'erreur : mettre à jour SGP40_VOC_ALGO_OPAQUE_SIZE dans STM32_SGP40.h. */
_Static_assert(sizeof(GasIndexAlgorithmParams) == SGP40_VOC_ALGO_OPAQUE_SIZE,
               "SGP40_VOC_ALGO_OPAQUE_SIZE ne correspond pas a sizeof(GasIndexAlgorithmParams) — mettre a jour STM32_SGP40.h");

/* ============================================================================
 * Private function prototypes
 * ============================================================================ */
static uint8_t SGP40_CalculateCRC8(const uint8_t *data, size_t len);
static SGP40_Status SGP40_MapHalStatus(HAL_StatusTypeDef hal_status);
static SGP40_Status SGP40_WriteCommand(SGP40_Handle_t *hsgp40, uint16_t cmd);
static SGP40_Status SGP40_WriteCommandWithData(SGP40_Handle_t *hsgp40, uint16_t cmd, const uint8_t *data, size_t data_len);
static SGP40_Status SGP40_ReadData(SGP40_Handle_t *hsgp40, uint8_t *data, size_t len);
static uint16_t SGP40_TempToRaw(float temp_c);
static uint16_t SGP40_RHToRaw(float rh_percent);
static SGP40_Status SGP40_Async_TriggerMeasure_Common(SGP40_Async_t *ctx);

/* ============================================================================
 * Private functions
 * ============================================================================ */

/**
 * @brief Calcule CRC-8 (polynomial Sensirion 0x31)
 * @param data Données à vérifier
 * @param len  Longueur
 * @retval CRC8
 */
static uint8_t SGP40_CalculateCRC8(const uint8_t *data, size_t len) {
    uint8_t crc = SGP40_CRC8_INIT;                    // Valeur initiale 0xFF (Sensirion)

    for (size_t i = 0; i < len; i++) {                // Itère sur chaque octet d'entrée
        crc ^= data[i];                                // XOR avec l'octet courant
        for (uint8_t bit = 0; bit < 8; bit++) {        // Traite les 8 bits de l'octet
            if (crc & 0x80) {                          // Si bit de poids fort = 1
                crc = (crc << 1) ^ SGP40_CRC8_POLYNOMIAL; // Décale + applique le polynôme
            } else {                                   // Sinon
                crc <<= 1;                             // Décale sans XOR
            }
        }
    }

    return crc;                                        // Retourne le CRC-8 calculé
}

/**
 * @brief Convertit un statut HAL I2C en code statut SGP40
 * @param hal_status Code de retour HAL
 * @retval SGP40_Status
 */
static SGP40_Status SGP40_MapHalStatus(HAL_StatusTypeDef hal_status) {
    if (hal_status == HAL_BUSY) {
        return SGP40_ERR_BUSY;
    }
    if (hal_status == HAL_TIMEOUT) {
        return SGP40_ERR_TIMEOUT;
    }
    return SGP40_ERR_I2C;
}

/**
 * @brief Envoie commande 16 bits (MSB first)
 * @param hsgp40 Handle SGP40
 * @param cmd    Commande 16 bits
 * @retval SGP40_Status
 * @note  Met à jour consecutive_errors et last_error dans le handle.
 */
static SGP40_Status SGP40_WriteCommand(SGP40_Handle_t *hsgp40, uint16_t cmd) {
    if (!hsgp40 || !hsgp40->hi2c) {                   // Vérifie handle valide
        return SGP40_ERR_NULL_PTR;
    }

    uint8_t buf[2];                                    // Buffer 2 octets pour la commande
    buf[0] = (cmd >> 8) & 0xFF;                        // Octet de poids fort (MSB)
    buf[1] = cmd & 0xFF;                               // Octet de poids faible (LSB)

    HAL_StatusTypeDef hal_status = HAL_I2C_Master_Transmit(  // Envoi I2C bloquant
        hsgp40->hi2c,                                  // Handle I2C HAL
        (uint16_t)(hsgp40->i2c_addr_7b << 1),          // Adresse esclave (7-bit convertie HAL)
        buf,                                           // Données à envoyer
        2,                                             // 2 octets = 1 commande Sensirion
        hsgp40->i2c_timeout                            // Timeout configuré dans le handle
    );

    if (hal_status != HAL_OK) {                        // Erreur de transmission
        hsgp40->last_hal_error = HAL_I2C_GetError(hsgp40->hi2c); // Code HAL bas niveau
        hsgp40->consecutive_errors++;                  // Erreur consécutive comptabilisée
        hsgp40->last_error = SGP40_MapHalStatus(hal_status);
        return hsgp40->last_error;
    }

    hsgp40->last_hal_error = 0U;
    hsgp40->consecutive_errors = 0;                    // Succès : remet le compteur à zéro
    return SGP40_OK;
}

/**
 * @brief Envoie commande + données avec CRC
 * @param hsgp40   Handle SGP40
 * @param cmd      Commande 16 bits
 * @param data     Données (format: MSB, LSB, CRC, MSB, LSB, CRC, ...)
 * @param data_len Longueur données (multiple de 3: 2 bytes + CRC)
 * @retval SGP40_Status
 * @note  Met à jour consecutive_errors et last_error dans le handle.
 */
static SGP40_Status SGP40_WriteCommandWithData(SGP40_Handle_t *hsgp40, uint16_t cmd, const uint8_t *data, size_t data_len) {
    if (!hsgp40 || !hsgp40->hi2c || !data) {           // Vérifie tous les pointeurs
        return SGP40_ERR_NULL_PTR;
    }

    if (data_len % 3 != 0) {                           // Format Sensirion: multiples de 3 (word + CRC)
        return SGP40_ERR_INVALID_PARAM;
    }

    uint8_t buf[SGP40_CMD_DATA_BUF_SIZE];              // Buffer local : commande + données
    if (data_len + 2 > sizeof(buf)) {                  // Vérifie que les données rentrent dans le buffer
        return SGP40_ERR_INVALID_PARAM;
    }

