TutoElectroWeb/STM32_SGP40/STM32_SGP40.c
    buf[0] = (cmd >> 8) & 0xFF;                        // Commande MSB en premier
    buf[1] = cmd & 0xFF;                               // Commande LSB
    memcpy(&buf[2], data, data_len);                   // Copie les paramètres (words + CRCs)

    HAL_StatusTypeDef hal_status = HAL_I2C_Master_Transmit(  // Envoi commande + paramètres
        hsgp40->hi2c,
        (uint16_t)(hsgp40->i2c_addr_7b << 1),
        buf,
        2 + data_len,
        hsgp40->i2c_timeout
    );

    if (hal_status != HAL_OK) {                        // Erreur de transmission
        hsgp40->last_hal_error = HAL_I2C_GetError(hsgp40->hi2c);
        hsgp40->consecutive_errors++;
        hsgp40->last_error = SGP40_MapHalStatus(hal_status);
        return hsgp40->last_error;
    }

    hsgp40->last_hal_error = 0U;
    hsgp40->consecutive_errors = 0;                    // Succès TX
    return SGP40_OK;
}

/**
 * @brief Lit données avec vérification CRC (format: word0_MSB, word0_LSB, CRC0, ...)
 * @param hsgp40 Handle SGP40
 * @param data   Buffer réception (doit contenir mots + CRCs)
 * @param len    Longueur totale (multiple de 3)
 * @retval SGP40_Status
 * @note  Met à jour consecutive_errors et last_error dans le handle.
 */
static SGP40_Status SGP40_ReadData(SGP40_Handle_t *hsgp40, uint8_t *data, size_t len) {
    if (!hsgp40 || !hsgp40->hi2c || !data) {           // Vérifie tous les pointeurs
        return SGP40_ERR_NULL_PTR;
    }

    if (len % 3 != 0) {                                // Format Sensirion: multiples de 3 (word + CRC)
        return SGP40_ERR_INVALID_PARAM;
    }

    HAL_StatusTypeDef hal_status = HAL_I2C_Master_Receive(  // Réception I2C bloquante
        hsgp40->hi2c,
        (uint16_t)(hsgp40->i2c_addr_7b << 1),
        data,
        len,
        hsgp40->i2c_timeout
    );

    if (hal_status != HAL_OK) {                        // Erreur de réception
        hsgp40->last_hal_error = HAL_I2C_GetError(hsgp40->hi2c);
        hsgp40->consecutive_errors++;
        hsgp40->last_error = SGP40_MapHalStatus(hal_status);
        return hsgp40->last_error;
    }

    // Vérification CRC pour chaque mot (2 bytes + CRC)
    for (size_t i = 0; i < len; i += 3) {             // Avance de 3 en 3 (word + CRC)
        uint8_t crc_calc = SGP40_CalculateCRC8(&data[i], 2);  // CRC sur les 2 octets du mot
        if (crc_calc != data[i + 2]) {                 // Compare avec le CRC reçu
            hsgp40->consecutive_errors++;
            hsgp40->last_error = SGP40_ERR_CRC;
            return SGP40_ERR_CRC;
        }
    }

    hsgp40->last_hal_error = 0U;
    hsgp40->consecutive_errors = 0;                    // Toutes données valides : reset erreurs
    return SGP40_OK;
}

/**
 * @brief Conversion température °C → raw Sensirion
 * @param temp_c Température (°C)
 * @retval Raw value (uint16_t)
 * @note  Format: raw = (T + 45) * 65535 / 175
 */
static uint16_t SGP40_TempToRaw(float temp_c) {
    // Clamp sur la plage physique capteur [-45°C, +130°C]
    if (temp_c < -45.0f) temp_c = -45.0f;             // Limite basse datasheet
    if (temp_c > 130.0f) temp_c = 130.0f;             // Limite haute datasheet

    return (uint16_t)((temp_c + 45.0f) * 65535.0f / 175.0f);  // Formule Sensirion => [0, 65535]
}

/**
 * @brief Conversion humidité % → raw Sensirion
 * @param rh_percent Humidité relative (%)
 * @retval Raw value (uint16_t)
 * @note  Format: raw = RH% * 65535 / 100
 */
static uint16_t SGP40_RHToRaw(float rh_percent) {
    // Clamp sur la plage physique [0%, 100%]
    if (rh_percent < 0.0f)   rh_percent = 0.0f;       // Limite basse (0% HR)
    if (rh_percent > 100.0f) rh_percent = 100.0f;     // Limite haute (100% HR)

    return (uint16_t)(rh_percent * 65535.0f / 100.0f);  // Formule Sensirion => [0, 65535]
}

/* ============================================================================
 * Public functions
 * ============================================================================ */

/**
 * @brief Initialise le handle SGP40 avec les valeurs par défaut
 * @param hsgp40 Handle SGP40 (non NULL)
 * @param hi2c   Handle I2C HAL (non NULL)
 * @retval SGP40_Status
 * @note  Initialise tous les champs du handle avec les valeurs par défaut,
 *        lance l'algo VOC et effectue une première mesure silencieuse (prime).
 */
SGP40_Status SGP40_Init(SGP40_Handle_t *hsgp40, I2C_HandleTypeDef *hi2c) {
    if (hsgp40 == NULL || hi2c == NULL) {             // Vérifie les deux pointeurs obligatoires
        return SGP40_ERR_NULL_PTR;
    }

    // Remplissage complet du handle avec les valeurs par défaut
    hsgp40->hi2c                    = hi2c;
    hsgp40->i2c_addr_7b             = SGP40_I2C_ADDR_7B;
    hsgp40->i2c_timeout             = SGP40_DEFAULT_TIMEOUT_MS;
    hsgp40->temp_c                  = SGP40_DEFAULT_TEMP_C;
    hsgp40->rh_percent              = SGP40_DEFAULT_RH_PERCENT;
    hsgp40->sample_interval_ms      = SGP40_DEFAULT_SAMPLE_INTERVAL_MS;
    hsgp40->measurement_mode_active = false;
    hsgp40->last_measure_tick_ms    = 0U;
    hsgp40->measure_count           = 0U;
    hsgp40->voc_algo_initialized    = false;
    hsgp40->last_voc_raw            = 0U;
    // Suivi erreurs — remis à zéro au démarrage
    hsgp40->consecutive_errors      = 0U;
    hsgp40->last_error              = SGP40_OK;
    hsgp40->last_hal_error          = 0U;
    hsgp40->async_busy              = 0U;

    // Initialise l'algorithme VOC Sensirion
    GasIndexAlgorithm_init_with_sampling_interval(
        SGP40_VOC_ALGO(hsgp40),
        GasIndexAlgorithm_ALGORITHM_TYPE_VOC,
        ((float)hsgp40->sample_interval_ms) / 1000.0f
    );
    hsgp40->voc_algo_initialized = true;

    // Vérification présence capteur (lecture serial number)
    SGP40_Status status = SGP40_GetSerialNumber(hsgp40, &hsgp40->serial_number);
    if (status != SGP40_OK) {
        return status;
    }

    hsgp40->initialized = true;

    // Première mesure silencieuse ("prime") pour activer l'algo VOC dès le démarrage
    uint16_t raw_discard = 0U;
    SGP40_MeasureRaw(hsgp40, &raw_discard);            // Échec ignoré volontairement
    // Remet les deux champs à l'état initial : la prime interne ne doit pas bloquer
    // PrimeForVocIndex() ni la première mesure utilisateur via la garde de cadence.
    hsgp40->measurement_mode_active = false;
    hsgp40->last_measure_tick_ms    = 0U;

    return SGP40_OK;
}

/**
 * @brief Réinitialise le handle SGP40 (libère ressources logicielles)
 * @param hsgp40 Handle SGP40 (non NULL)
 * @retval SGP40_Status
 */
SGP40_Status SGP40_DeInit(SGP40_Handle_t *hsgp40) {
    if (!hsgp40) {
        return SGP40_ERR_NULL_PTR;
    }

    if (hsgp40->async_busy) {                          // Refuse si un transfert IT est en cours
        return SGP40_ERR_BUSY;
    }

    memset(hsgp40, 0, sizeof(SGP40_Handle_t));         // Remet tout à zéro : initialized=false, hi2c=NULL, etc.
    return SGP40_OK;
}

/**
 * @brief Lecture serial number 48 bits
 * @param hsgp40 Handle SGP40
 * @param serial Pointeur pour stocker serial (6 octets)
 * @retval SGP40_Status
 */
SGP40_Status SGP40_GetSerialNumber(SGP40_Handle_t *hsgp40, uint64_t *serial) {
    if (!hsgp40 || !serial) {                          // Vérifie les deux pointeurs
        return SGP40_ERR_NULL_PTR;
    }

    *serial = 0U;

