TutoElectroWeb/STM32_SGP40/STM32_SGP40.c
    if (hsgp40->async_busy) {                          // Guard : interdit si async en cours
        return SGP40_ERR_BUSY;
    }

    // Envoi commande Get Serial Number
    SGP40_Status status = SGP40_WriteCommand(hsgp40, SGP40_CMD_GET_SERIAL);
    if (status != SGP40_OK) {
        return status;
    }

    HAL_Delay(SGP40_SERIAL_READ_DELAY_MS);  // datasheet §5.3 : délai post-commande < 1 ms

    // Lecture 9 bytes: 3 words (2 bytes + CRC chaque)
    uint8_t buf[SGP40_SERIAL_SIZE];
    status = SGP40_ReadData(hsgp40, buf, SGP40_SERIAL_SIZE);
    if (status != SGP40_OK) {
        return status;
    }

    // Reconstruction serial 48 bits (6 octets utiles, octets CRC ignorés)
    *serial = 0;
    *serial |= ((uint64_t)buf[0] << 40);               // Word 0 : MSB (bits 47-40)
    *serial |= ((uint64_t)buf[1] << 32);               // Word 0 : LSB (bits 39-32)
    *serial |= ((uint64_t)buf[3] << 24);               // Word 1 : MSB (bits 31-24) [buf[2]=CRC]
    *serial |= ((uint64_t)buf[4] << 16);               // Word 1 : LSB (bits 23-16)
    *serial |= ((uint64_t)buf[6] << 8);                // Word 2 : MSB (bits 15-8)  [buf[5]=CRC]
    *serial |= ((uint64_t)buf[7]);                     // Word 2 : LSB (bits 7-0)

    return SGP40_OK;
}

/**
 * @brief Auto-test capteur (heater + sensor)
 * @param hsgp40      Handle SGP40
 * @param test_result Résultat brut — SGP40_TEST_RESULT_OK (0xD400) = OK,
 *                    SGP40_TEST_RESULT_FAIL (0x4B00) = échec.
 *                    Datasheet §5.2 : octet bas toujours 0x00.
 * @retval SGP40_OK            si *test_result == 0xD400
 * @retval SGP40_ERR_SELF_TEST si *test_result != 0xD400
 * @note  Bloquant jusqu'à SGP40_SELFTEST_WAIT_MS (320 ms).
 */
SGP40_Status SGP40_SelfTest(SGP40_Handle_t *hsgp40, uint16_t *test_result) {
    if (!hsgp40 || !test_result) {
        return SGP40_ERR_NULL_PTR;
    }

    *test_result = 0U;

    if (hsgp40->async_busy) {                          // Guard : interdit si async en cours
        return SGP40_ERR_BUSY;
    }

    SGP40_Status status = SGP40_WriteCommand(hsgp40, SGP40_CMD_MEASURE_TEST);
    if (status != SGP40_OK) {
        return status;
    }

    HAL_Delay(SGP40_SELFTEST_WAIT_MS);                 // Attente 320ms (durée max datasheet)

    uint8_t buf[3];                                    // MSB, LSB, CRC
    status = SGP40_ReadData(hsgp40, buf, 3);
    if (status != SGP40_OK) {
        return status;
    }

    *test_result = (uint16_t)((buf[0] << 8) | buf[1]); // Assemble résultat 16 bits

    if (*test_result != SGP40_TEST_OK_VALUE) {              // vérifie valeur exacte 0xD400 (datasheet §5.2 : octet bas toujours 0x00)
        hsgp40->consecutive_errors++;
        hsgp40->last_error = SGP40_ERR_SELF_TEST;
        return SGP40_ERR_SELF_TEST;
    }

    hsgp40->consecutive_errors = 0;                    // Auto-test réussi
    return SGP40_OK;
}

/**
 * @brief Mesure VOC raw (signal brut 0-65535)
 * @param hsgp40  Handle SGP40
 * @param voc_raw Pointeur pour stocker signal VOC raw
 * @retval SGP40_Status
 * @note  Bloquant ~SGP40_MEASURE_WAIT_MS (30 ms), utilise compensation T/RH configurée dans handle.
 *        Retourne SGP40_ERR_BUSY si async en cours ou cadence non respectée.
 */
SGP40_Status SGP40_MeasureRaw(SGP40_Handle_t *hsgp40, uint16_t *voc_raw) {
    if (!hsgp40 || !voc_raw) {
        return SGP40_ERR_NULL_PTR;
    }

    *voc_raw = 0U;

    if (!hsgp40->initialized) {
        return SGP40_ERR_NOT_INITIALIZED;              // SGP40_Init() non appelé ou HeaterOff() effectué
    }

    if (hsgp40->async_busy) {                          // Guard : interdit si async en cours
        return SGP40_ERR_BUSY;
    }

    uint32_t now_ms = HAL_GetTick();
    if (hsgp40->measurement_mode_active) {             // Si déjà en mode mesure (au moins 1 sample)
        uint32_t elapsed = now_ms - hsgp40->last_measure_tick_ms;
        if (elapsed < hsgp40->sample_interval_ms) {    // Trop tôt : cadence non respectée
            return SGP40_ERR_BUSY;
        }
    }

    // Préparation données de compensation : RH (word + CRC), T° (word + CRC)
    uint16_t rh_raw   = SGP40_RHToRaw(hsgp40->rh_percent);
    uint16_t temp_raw = SGP40_TempToRaw(hsgp40->temp_c);

    uint8_t data[6];
    data[0] = (rh_raw >> 8) & 0xFF;                   // HR MSB
    data[1] = rh_raw & 0xFF;                           // HR LSB
    data[2] = SGP40_CalculateCRC8(&data[0], 2);        // CRC sur les 2 octets HR
    data[3] = (temp_raw >> 8) & 0xFF;                  // T° MSB
    data[4] = temp_raw & 0xFF;                         // T° LSB
    data[5] = SGP40_CalculateCRC8(&data[3], 2);        // CRC sur les 2 octets T°

    /* Mémoriser le tick AVANT le délai bloquant : cohérence avec le mode async
     * où last_measure_tick_ms est pris avant le transfert IT.
     * L'intervalle de cadence est mesuré depuis le déclenchement de la mesure,
     * pas depuis sa fin, pour un résultat identique quel que soit le mode. */
    hsgp40->measurement_mode_active = true;            // Active la garde de cadence
    hsgp40->last_measure_tick_ms    = now_ms;          // Tick pris AVANT HAL_Delay (cohérence async)

    SGP40_Status status = SGP40_WriteCommandWithData(hsgp40, SGP40_CMD_MEASURE_RAW, data, 6);
    if (status != SGP40_OK) {
        hsgp40->measurement_mode_active = false;       // Annule la garde si TX échoue
        hsgp40->last_measure_tick_ms    = 0U;
        return status;
    }

    HAL_Delay(SGP40_MEASURE_WAIT_MS);                  // Attente conversion ~30ms (datasheet)

    uint8_t buf[3];
    status = SGP40_ReadData(hsgp40, buf, 3);
    if (status != SGP40_OK) {
        return status;
    }

    *voc_raw = (uint16_t)((buf[0] << 8) | buf[1]);     // Assemble valeur VOC raw 16 bits
    hsgp40->last_voc_raw = *voc_raw;                   // Sauvegarde pour accès rapide
    hsgp40->measure_count++;                           // Incrémente compteur warmup algo

    return SGP40_OK;
}

/**
 * @brief Prime le capteur pour usage VOC Index (discard première mesure)
 * @param hsgp40 Handle SGP40
 * @retval SGP40_Status
 */
SGP40_Status SGP40_PrimeForVocIndex(SGP40_Handle_t *hsgp40) {
    if (!hsgp40) {
        return SGP40_ERR_NULL_PTR;
    }

