TutoElectroWeb/STM32_SGP40/STM32_SGP40.c
    if (hsgp40->async_busy) {                          // Guard : interdit si async en cours
        return SGP40_ERR_BUSY;
    }

    // Bypass de la garde de cadence : PrimeForVocIndex est une opération d'init,
    // pas une mesure de boucle. Elle peut être appelée immédiatement après Init().
    hsgp40->measurement_mode_active = false;
    hsgp40->last_measure_tick_ms    = 0U;

    uint16_t discarded = 0;
    SGP40_Status status = SGP40_MeasureRaw(hsgp40, &discarded);

    // Après prime : remet à zéro pour ne pas bloquer la première mesure utilisateur.
    hsgp40->measurement_mode_active = false;
    hsgp40->last_measure_tick_ms    = 0U;

    return status;
}

/**
 * @brief Configure l'intervalle minimal entre mesures
 * @param hsgp40      Handle SGP40
 * @param interval_ms Intervalle en ms (plage supportée: 500..10000)
 * @retval SGP40_Status
 * @note  ⚠️  Réinitialise l'algorithme VOC Sensirion si déjà actif :
 *        l'état d'apprentissage accumulé (baseline, gain, offset) est perdu.
 *        Appeler uniquement en phase d'initialisation, avant toute acquisition.
 */
SGP40_Status SGP40_SetSampleInterval(SGP40_Handle_t *hsgp40, uint32_t interval_ms) {
    if (!hsgp40) {
        return SGP40_ERR_NULL_PTR;
    }

    if (interval_ms < 500U || interval_ms > 10000U) {  // Plage validée : 0.5s à 10s
        return SGP40_ERR_INVALID_PARAM;
    }

    hsgp40->sample_interval_ms = interval_ms;

    if (hsgp40->voc_algo_initialized) {                // Si l'algo est déjà actif : reconfigurer
        GasIndexAlgorithm_init_with_sampling_interval(
            SGP40_VOC_ALGO(hsgp40),
            GasIndexAlgorithm_ALGORITHM_TYPE_VOC,
            ((float)hsgp40->sample_interval_ms) / 1000.0f
        );
        /* L'algo VOC est ré-initialisé → le warmup doit recommencer.
         * Sans ce reset, IsVOCWarmupComplete() retournerait true à tort. */
        hsgp40->measure_count = 0U;
    }

    return SGP40_OK;
}

/**
 * @brief Configure compensation température/humidité
 * @param hsgp40     Handle SGP40
 * @param temp_c     Température (°C), plage -45 à +130
 * @param rh_percent Humidité relative (%), plage 0 à 100
 * @retval SGP40_Status
 */
SGP40_Status SGP40_SetCompensation(SGP40_Handle_t *hsgp40, float temp_c, float rh_percent) {
    if (!hsgp40) {
        return SGP40_ERR_NULL_PTR;
    }

    if (temp_c < -45.0f || temp_c > 130.0f) {
        return SGP40_ERR_INVALID_PARAM;
    }
    if (rh_percent < 0.0f || rh_percent > 100.0f) {
        return SGP40_ERR_INVALID_PARAM;
    }

    hsgp40->temp_c     = temp_c;
    hsgp40->rh_percent = rh_percent;

    return SGP40_OK;
}

/**
 * @brief Extinction heater (mode power-down)
 * @param hsgp40 Handle SGP40
 * @retval SGP40_Status
 * @note  Réduit consommation ~0.1µA, nécessite SGP40_Init() après réutilisation.
 */
SGP40_Status SGP40_HeaterOff(SGP40_Handle_t *hsgp40) {
    if (!hsgp40) {
        return SGP40_ERR_NULL_PTR;
    }

    if (hsgp40->async_busy) {                          // Guard : interdit si async en cours
        return SGP40_ERR_BUSY;
    }

    SGP40_Status status = SGP40_WriteCommand(hsgp40, SGP40_CMD_HEATER_OFF);
    if (status == SGP40_OK) {
        hsgp40->initialized           = false;         // Nécessite un SGP40_Init() après réutilisation
        hsgp40->measurement_mode_active = false;
        hsgp40->last_measure_tick_ms  = 0U;
        hsgp40->measure_count         = 0U;
        hsgp40->voc_algo_initialized  = false;
    }

    return status;
}

/**
 * @brief Soft Reset via I2C General Call (réinitialise TOUS les périphériques I2C du bus)
 * @param hsgp40 Handle SGP40 (pour accéder à hi2c et i2c_timeout)
 * @retval SGP40_OK              Reset envoyé avec succès
 * @retval SGP40_ERR_NULL_PTR    hsgp40 NULL
 * @retval SGP40_ERR_NOT_CONFIGURED  hi2c non configuré
 * @retval SGP40_ERR_BUSY        async en cours
 * @retval SGP40_ERR_TIMEOUT     timeout I2C (bus bloqué)
 * @warning ⚠️  Reset I2C General Call (addr 0x00) : TOUS les périphériques I2C
 *          du bus sont réinitialisés, pas uniquement le SGP40.
 * @note   Implémente sensirion_i2c_general_call_reset() du driver Sensirion RPi.
 *         Certains périphériques n'ACK pas la General Call → HAL_ERROR peut
 *         survenir même si le reset a été exécuté (retour SGP40_OK conservatoire).
 *         Après appel, le SGP40 est en état POR → appeler SGP40_Init() avant usage.
 */
SGP40_Status SGP40_SoftReset(SGP40_Handle_t *hsgp40) {
    if (!hsgp40) {
        return SGP40_ERR_NULL_PTR;
    }

    if (!hsgp40->hi2c) {
        return SGP40_ERR_NOT_CONFIGURED;
    }

    if (hsgp40->async_busy) {                          // Guard : interdit si async en cours
        return SGP40_ERR_BUSY;
    }

    /* General Call Reset : I2C addr=0x00 (7-bit) → DevAddress=0x00, data=0x06
     * Conforme NXP I2C spec §3.1.12 et driver Sensirion sensirion_i2c_general_call_reset().
     * Remet tous les périphériques I2C sur le bus à leur état POR. */
    const uint8_t reset_cmd = 0x06U;
    HAL_StatusTypeDef hal_status = HAL_I2C_Master_Transmit(
        hsgp40->hi2c,
        (uint16_t)0x00U,                               // General Call addr 7-bit = 0x00, HAL attend addr << 1 (déjà 0)
        (uint8_t *)&reset_cmd,
        1U,
        hsgp40->i2c_timeout
    );

    /* Invalide l'état du handle : le SGP40 a redémarré (POR) */
    hsgp40->initialized             = false;
    hsgp40->measurement_mode_active = false;
    hsgp40->last_measure_tick_ms    = 0U;
    hsgp40->measure_count           = 0U;
    hsgp40->voc_algo_initialized    = false;

    /* NACK sur General Call est normal (certains périphériques ne l'ACK pas).
     * HAL retourne HAL_ERROR avec I2C AF flag même si la trame a été émise.
     * On retourne SGP40_OK dès que le bus n'était pas en timeout. */
    if (hal_status == HAL_OK || hal_status == HAL_ERROR) {
        hsgp40->consecutive_errors = 0U;
        return SGP40_OK;
    }

    return SGP40_MapHalStatus(hal_status);             // Propage HAL_BUSY ou HAL_TIMEOUT
}

/**
 * @brief Calcule VOC Index depuis VOC raw (algorithme officiel Sensirion)
 * @param hsgp40    Handle SGP40 (contient l'état interne de l'algorithme)
 * @param voc_raw   Signal VOC raw (0-65535)
 * @param voc_index Pointeur pour stocker VOC index (0-500)
 * @retval SGP40_Status
 */
SGP40_Status SGP40_CalculateVOCIndex(SGP40_Handle_t *hsgp40, uint16_t voc_raw, uint16_t *voc_index) {
    if (!hsgp40 || !voc_index) {
        return SGP40_ERR_NULL_PTR;
    }

    if (!hsgp40->voc_algo_initialized) {
        return SGP40_ERR_NOT_READY;
    }

