TutoElectroWeb/STM32_SGP40/STM32_SGP40.c
    int32_t gas_index = 0;
    GasIndexAlgorithm_process(SGP40_VOC_ALGO(hsgp40), (int32_t)voc_raw, &gas_index);

    if (gas_index < 0)   gas_index = 0;               // Clamp bas
    if (gas_index > 500) gas_index = 500;              // Clamp haut

    *voc_index = (uint16_t)gas_index;

    return SGP40_OK;
}

/**
 * @brief Reset des états internes de l'algorithme VOC Sensirion
 * @param hsgp40 Handle SGP40
 * @retval SGP40_Status
 */
SGP40_Status SGP40_VOCAlgoReset(SGP40_Handle_t *hsgp40) {
    if (!hsgp40) {
        return SGP40_ERR_NULL_PTR;
    }
    if (!hsgp40->voc_algo_initialized) {
        return SGP40_ERR_NOT_READY;
    }

    GasIndexAlgorithm_reset(SGP40_VOC_ALGO(hsgp40));
    return SGP40_OK;
}

/**
 * @brief Récupère les états VOC (pour persistance / reprise)
 */
SGP40_Status SGP40_VOCAlgoGetStates(const SGP40_Handle_t *hsgp40, float *state0, float *state1) {
    if (!hsgp40 || !state0 || !state1) {
        return SGP40_ERR_NULL_PTR;
    }
    if (!hsgp40->voc_algo_initialized) {
        return SGP40_ERR_NOT_READY;
    }

    GasIndexAlgorithm_get_states(SGP40_VOC_ALGO(hsgp40), state0, state1);
    return SGP40_OK;
}

/**
 * @brief Restaure les états VOC (reprise après interruption courte)
 */
SGP40_Status SGP40_VOCAlgoSetStates(SGP40_Handle_t *hsgp40, float state0, float state1) {
    if (!hsgp40) {
        return SGP40_ERR_NULL_PTR;
    }
    if (!hsgp40->voc_algo_initialized) {
        return SGP40_ERR_NOT_READY;
    }

    GasIndexAlgorithm_set_states(SGP40_VOC_ALGO(hsgp40), state0, state1);
    return SGP40_OK;
}

/**
 * @brief Configure les paramètres de tuning de l'algorithme VOC
 */
SGP40_Status SGP40_VOCAlgoSetTuning(
    SGP40_Handle_t *hsgp40,
    int32_t index_offset,
    int32_t learning_time_offset_hours,
    int32_t learning_time_gain_hours,
    int32_t gating_max_duration_minutes,
    int32_t std_initial,
    int32_t gain_factor
) {
    if (!hsgp40) {
        return SGP40_ERR_NULL_PTR;
    }
    if (!hsgp40->voc_algo_initialized) {
        return SGP40_ERR_NOT_READY;
    }

    GasIndexAlgorithm_set_tuning_parameters(
        SGP40_VOC_ALGO(hsgp40),
        index_offset,
        learning_time_offset_hours,
        learning_time_gain_hours,
        gating_max_duration_minutes,
        std_initial,
        gain_factor
    );
    return SGP40_OK;
}

/**
 * @brief Lit les paramètres de tuning de l'algorithme VOC
 */
SGP40_Status SGP40_VOCAlgoGetTuning(
    const SGP40_Handle_t *hsgp40,
    int32_t *index_offset,
    int32_t *learning_time_offset_hours,
    int32_t *learning_time_gain_hours,
    int32_t *gating_max_duration_minutes,
    int32_t *std_initial,
    int32_t *gain_factor
) {
    if (!hsgp40 || !index_offset || !learning_time_offset_hours || !learning_time_gain_hours ||
        !gating_max_duration_minutes || !std_initial || !gain_factor) {
        return SGP40_ERR_NULL_PTR;
    }
    if (!hsgp40->voc_algo_initialized) {
        return SGP40_ERR_NOT_READY;
    }

    GasIndexAlgorithm_get_tuning_parameters(
        SGP40_VOC_ALGO(hsgp40),
        index_offset,
        learning_time_offset_hours,
        learning_time_gain_hours,
        gating_max_duration_minutes,
        std_initial,
        gain_factor
    );
    return SGP40_OK;
}

/**
 * @brief Lit l'intervalle d'échantillonnage utilisé par l'algorithme (secondes)
 */
SGP40_Status SGP40_VOCAlgoGetSamplingInterval(const SGP40_Handle_t *hsgp40, float *sampling_interval_s) {
    if (!hsgp40 || !sampling_interval_s) {
        return SGP40_ERR_NULL_PTR;
    }
    if (!hsgp40->voc_algo_initialized) {
        return SGP40_ERR_NOT_READY;
    }

    GasIndexAlgorithm_get_sampling_interval(SGP40_VOC_ALGO(hsgp40), sampling_interval_s);
    return SGP40_OK;
}

/**
 * @brief Catégorise VOC Index (qualité air)
 */
SGP40_VOC_Category SGP40_GetVOCCategory(uint16_t voc_index) {
    if (voc_index <= 100) {
        return SGP40_VOC_EXCELLENT;
    } else if (voc_index <= 150) {
        return SGP40_VOC_GOOD;
    } else if (voc_index <= 200) {
        return SGP40_VOC_MODERATE;
    } else if (voc_index <= 300) {
        return SGP40_VOC_POOR;
    } else if (voc_index <= 500) {
        return SGP40_VOC_UNHEALTHY;
    } else {
        return SGP40_VOC_INVALID;
    }
}

/**
 * @brief Conversion VOC category → texte
 */
const char* SGP40_VOCCategoryToString(SGP40_VOC_Category category) {
    switch (category) {
        case SGP40_VOC_EXCELLENT:  return "Excellent (0-100)";
        case SGP40_VOC_GOOD:       return "Bon (101-150)";
        case SGP40_VOC_MODERATE:   return "Modere (151-200)";
        case SGP40_VOC_POOR:       return "Mauvais (201-300)";
        case SGP40_VOC_UNHEALTHY:  return "Insalubre (301-500)";
        case SGP40_VOC_INVALID:
        default:                   return "Invalide";
    }
}

/**
 * @brief Conversion code erreur → texte
 * @note  Compilé uniquement si SGP40_DEBUG_ENABLE est défini (économie Flash).
 *        Retourne chaîne vide en production.
 */
const char* SGP40_StatusToString(SGP40_Status code) {
#ifdef SGP40_DEBUG_ENABLE
    switch (code) {
        case SGP40_OK:                 return "OK";
        case SGP40_ERR_NULL_PTR:       return "Erreur: pointeur NULL";
        case SGP40_ERR_INVALID_PARAM:  return "Erreur: parametre invalide";
        case SGP40_ERR_NOT_CONFIGURED: return "Erreur: configuration HAL/NVIC manquante";
        case SGP40_ERR_BUSY:           return "Erreur: bus occupe ou cadence";
        case SGP40_ERR_I2C:            return "Erreur: I2C communication";
        case SGP40_ERR_CRC:            return "Erreur: CRC invalide";
        case SGP40_ERR_SELF_TEST:      return "Erreur: auto-test echoue";
        case SGP40_ERR_NOT_READY:      return "Erreur: capteur pas pret";
        case SGP40_ERR_NOT_INITIALIZED: return "Erreur: capteur non initialise";
        case SGP40_ERR_TIMEOUT:        return "Erreur: timeout";
        case SGP40_ERR_OVERFLOW:       return "Erreur: file pleine";
        case SGP40_ERR_UNKNOWN:
        default:                       return "Erreur: inconnue";
    }
#else
    (void)code;
    return "";
#endif
}

