TutoElectroWeb/STM32_SGP40/STM32_SGP40.c
/* =============================================================================
 * Fonctions convenience (warmup + mesure tout-en-un)
 * ============================================================================= */

/**
 * @brief  Vérifie si la phase de warmup de l'algorithme VOC est terminée.
 * @param  hsgp40 Handle SGP40 (non NULL)
 * @retval true si measure_count >= ceil(INITIAL_BLACKOUT_s / sample_interval_s)
 * @note   GasIndexAlgorithm_INITIAL_BLACKOUT est en SECONDES. La conversion en
 *         nombre d'échantillons dépend de sample_interval_ms. Correct à tout intervalle.
 */
bool SGP40_IsVOCWarmupComplete(const SGP40_Handle_t *hsgp40) {
    if (!hsgp40) {
        return false;
    }
    float samples_needed = GasIndexAlgorithm_INITIAL_BLACKOUT
                         * 1000.0f / (float)hsgp40->sample_interval_ms;
    return hsgp40->measure_count >= (uint32_t)ceilf(samples_needed);
}

/**
 * @brief  Retourne le nombre d'échantillons nécessaires au warmup de l'algo VOC.
 * @param  hsgp40 Handle SGP40 (non NULL) — intervalle utilisé pour le calcul
 * @retval Nombre d'échantillons = ceil(45 s / sample_interval_s)
 * @note   Retourne 45 (valeur 1 Hz) si hsgp40 est NULL.
 */
uint32_t SGP40_GetVOCWarmupSamples(const SGP40_Handle_t *hsgp40) {
    if (!hsgp40) {
        return (uint32_t)GasIndexAlgorithm_INITIAL_BLACKOUT; /* fallback : 45 @ 1 Hz */
    }
    float samples_needed = GasIndexAlgorithm_INITIAL_BLACKOUT
                         * 1000.0f / (float)hsgp40->sample_interval_ms;
    return (uint32_t)ceilf(samples_needed);
}

/**
 * @brief  Mesure VOC raw + calcul VOC Index en un seul appel.
 * @param  hsgp40    Handle SGP40 (non NULL, initialisé)
 * @param  voc_raw   Pointeur pour stocker signal VOC raw (peut être NULL)
 * @param  voc_index Pointeur pour stocker VOC index 0-500 (non NULL)
 * @retval SGP40_Status
 */
SGP40_Status SGP40_MeasureVOCIndex(SGP40_Handle_t *hsgp40, uint16_t *voc_raw, uint16_t *voc_index) {
    if (!hsgp40 || !voc_index) {
        return SGP40_ERR_NULL_PTR;
    }

    uint16_t raw = 0;
    SGP40_Status status = SGP40_MeasureRaw(hsgp40, &raw);
    if (status != SGP40_OK) {
        return status;
    }

    if (voc_raw) {
        *voc_raw = raw;
    }

    return SGP40_CalculateVOCIndex(hsgp40, raw, voc_index);
}

SGP40_Status SGP40_ReadAll(SGP40_Handle_t *hsgp40, SGP40_Data *data_out) {
    if (!hsgp40 || !data_out) {
        return SGP40_ERR_NULL_PTR;
    }
    return SGP40_MeasureVOCIndex(hsgp40, &data_out->voc_raw, &data_out->voc_index);
}

/* =============================================================================
 * API Asynchrone (IT)
 * ============================================================================= */

/**
 * @brief  Vérifie si une IRQ NVIC est activée.
 */
static bool SGP40_IsIrqEnabledInternal(IRQn_Type irqn) {
    if (irqn < 0) {
        return false;
    }

    uint32_t irq_index = ((uint32_t)irqn) >> 5U;
    uint32_t irq_mask  = 1UL << (((uint32_t)irqn) & 0x1FU);
    return (NVIC->ISER[irq_index] & irq_mask) != 0U;
}

/**
 * @brief  Résout la paire IRQn (EV+ER) pour un périphérique I2C.
 */
static bool SGP40_GetI2CIrqPair(const I2C_HandleTypeDef *hi2c, IRQn_Type *ev_irq, IRQn_Type *er_irq) {
    if (!hi2c || !ev_irq || !er_irq) {
        return false;
    }

#ifdef I2C1
    if (hi2c->Instance == I2C1) { *ev_irq = I2C1_EV_IRQn; *er_irq = I2C1_ER_IRQn; return true; }
#endif
#ifdef I2C2
    if (hi2c->Instance == I2C2) { *ev_irq = I2C2_EV_IRQn; *er_irq = I2C2_ER_IRQn; return true; }
#endif
#ifdef I2C3
    if (hi2c->Instance == I2C3) { *ev_irq = I2C3_EV_IRQn; *er_irq = I2C3_ER_IRQn; return true; }
#endif
#ifdef I2C4
    if (hi2c->Instance == I2C4) { *ev_irq = I2C4_EV_IRQn; *er_irq = I2C4_ER_IRQn; return true; }
#endif

    return false;
}

/**
 * @brief  Vérifie configuration NVIC pour mode IT.
 */
static SGP40_Status SGP40_Async_CheckConfig_IT(const SGP40_Async_t *ctx) {
    if (!ctx || !ctx->hi2c) {
        return SGP40_ERR_NULL_PTR;
    }

    IRQn_Type ev_irq, er_irq;
    if (!SGP40_GetI2CIrqPair(ctx->hi2c, &ev_irq, &er_irq)) {
        return SGP40_ERR_NOT_CONFIGURED;
    }

    if (!SGP40_IsIrqEnabledInternal(ev_irq) || !SGP40_IsIrqEnabledInternal(er_irq)) {
        return SGP40_ERR_NOT_CONFIGURED;
    }

    return SGP40_OK;
}

/**
 * @brief Initialise contexte asynchrone
 * @param ctx    Contexte async à initialiser
 * @param hsgp40 Handle SGP40 synchrone (doit être déjà initialisé)
 */
void SGP40_Async_Init(SGP40_Async_t *ctx, SGP40_Handle_t *hsgp40) {
    if (!ctx || !hsgp40) return;

    memset(ctx, 0, sizeof(SGP40_Async_t));
    ctx->hsgp40      = hsgp40;
    ctx->hi2c        = hsgp40->hi2c;
    ctx->state       = SGP40_ASYNC_IDLE;
    ctx->last_status = SGP40_OK;
    // hsgp40->async_busy déjà à 0 (Init ou memset)
}

/**
 * @brief  Reset la machine d'état async sans perdre les callbacks/timebase.
 * @param  ctx Contexte async (non NULL)
 * @note   Préserve : hsgp40, hi2c, tous les callbacks, user_ctx.
 *         Remet : state=IDLE, flags=false, buffers=0, deadlines=0, async_busy=0.
 */
void SGP40_Async_Reset(SGP40_Async_t *ctx) {
    if (!ctx) return;

    ctx->state              = SGP40_ASYNC_IDLE;
    ctx->last_status        = SGP40_OK;
    ctx->meas_deadline_ms   = 0U;
    ctx->i2c_deadline_ms    = 0U;
    memset(ctx->cmd_buf, 0, sizeof(ctx->cmd_buf));
    memset(ctx->rx_buf,  0, sizeof(ctx->rx_buf));
    ctx->voc_raw             = 0U;
    ctx->data_ready_flag     = false;
    ctx->error_flag          = false;
    ctx->notify_data_pending = false;
    ctx->notify_error_pending = false;

    if (ctx->hsgp40) {
        ctx->hsgp40->async_busy = 0U;                 // Libère le verrou polling/async
    }
    /* hsgp40, hi2c, callbacks, user_ctx, irq_user_ctx : préservés */
}

/**
 * @brief Configure callbacks utilisateur (contexte main loop)
 */
void SGP40_Async_SetCallbacks(SGP40_Async_t *ctx,
                               SGP40_Async_OnDataReadyCb on_data_ready,
                               SGP40_Async_OnErrorCb on_error,
                               void *user_ctx) {
    if (!ctx) return;
    ctx->on_data_ready = on_data_ready;
    ctx->on_error      = on_error;
    ctx->user_ctx      = user_ctx;
}

/**
 * @brief Configure callbacks IRQ-safe (depuis interruptions I2C)
 */
void SGP40_Async_SetIrqCallbacks(SGP40_Async_t *ctx,
                                  SGP40_Async_OnIrqDataReadyCb on_irq_data_ready,
                                  SGP40_Async_OnIrqErrorCb on_irq_error,
                                  void *user_ctx) {
    if (!ctx) return;
    ctx->on_irq_data_ready = on_irq_data_ready;
    ctx->on_irq_error      = on_irq_error;
    ctx->irq_user_ctx      = user_ctx;   /* F1 : contexte IRQ distinct — ne pas écraser user_ctx main-loop */
}

/**
 * @brief Lecture flag données prêtes
 */
bool SGP40_Async_DataReadyFlag(const SGP40_Async_t *ctx) {
    return ctx ? ctx->data_ready_flag : false;
}

/**
 * @brief Lecture flag erreur
 */
bool SGP40_Async_ErrorFlag(const SGP40_Async_t *ctx) {
    return ctx ? ctx->error_flag : false;
}

/**
 * @brief Clear flags data_ready et error
 */
void SGP40_Async_ClearFlags(SGP40_Async_t *ctx) {
    if (!ctx) return;
    ctx->data_ready_flag      = false;
    ctx->error_flag           = false;
    ctx->notify_data_pending  = false;
    ctx->notify_error_pending = false;
}

/**
 * @brief Vérifie si machine d'état idle
 */
bool SGP40_Async_IsIdle(const SGP40_Async_t *ctx) {
    return ctx ? (ctx->state == SGP40_ASYNC_IDLE) : false;
}

/**
 * @brief Vérifie si données disponibles
 */
bool SGP40_Async_HasData(const SGP40_Async_t *ctx) {
    return ctx ? (ctx->state == SGP40_ASYNC_DONE && ctx->last_status == SGP40_OK) : false;
}

/**
 * @brief  Prépare et lance le transfert I2C en mode IT (non-bloquant).
 * @note   DMA non implémenté : aucun gain réel pour les trames SGP40
 *         (8 octets TX / 3 octets RX) — IT suffit et simplifie la configuration CubeMX.
 */
static SGP40_Status SGP40_Async_TriggerMeasure_Common(SGP40_Async_t *ctx) {
    uint32_t now_ms = HAL_GetTick();
    if (ctx->hsgp40->measurement_mode_active) {        // Si au moins une mesure déjà faite
        uint32_t elapsed = now_ms - ctx->hsgp40->last_measure_tick_ms;
        if (elapsed < ctx->hsgp40->sample_interval_ms) {
            return SGP40_ERR_BUSY;
        }
    }

    ctx->data_ready_flag      = false;
    ctx->error_flag           = false;
    ctx->notify_data_pending  = false;
    ctx->notify_error_pending = false;

    /* Préparer commande 0x260F + compensation T/RH (cmd 2B + RH 2B+CRC + T 2B+CRC = 8B) */
    uint16_t cmd = SGP40_CMD_MEASURE_RAW;
    ctx->cmd_buf[0] = (cmd >> 8) & 0xFF;
    ctx->cmd_buf[1] = cmd & 0xFF;

