TutoElectroWeb/STM32_SGP40/STM32_SGP40.c
    uint16_t rh_raw = SGP40_RHToRaw(ctx->hsgp40->rh_percent);
    uint16_t t_raw  = SGP40_TempToRaw(ctx->hsgp40->temp_c);

    ctx->cmd_buf[2] = (rh_raw >> 8) & 0xFF;
    ctx->cmd_buf[3] = rh_raw & 0xFF;
    ctx->cmd_buf[4] = SGP40_CalculateCRC8(&ctx->cmd_buf[2], 2);
    ctx->cmd_buf[5] = (t_raw >> 8) & 0xFF;
    ctx->cmd_buf[6] = t_raw & 0xFF;
    ctx->cmd_buf[7] = SGP40_CalculateCRC8(&ctx->cmd_buf[5], 2);

    /* Lancer transfert I2C en mode IT (non-bloquant) */
    HAL_StatusTypeDef hal_status = HAL_I2C_Master_Transmit_IT(
        ctx->hi2c,
        (uint16_t)(ctx->hsgp40->i2c_addr_7b << 1),
        ctx->cmd_buf, SGP40_ASYNC_CMD_BUF_SIZE);

    if (hal_status == HAL_BUSY) {
        /* Bus I2C occupé par une autre lib async IT sur le même hi2c.
         * La FSM reste IDLE : TriggerEvery() retentera automatiquement au prochain appel.
         * HAL_BUSY ne compte pas dans consecutive_errors (contention de bus normale). */
        ctx->state       = SGP40_ASYNC_IDLE;
        ctx->last_status = SGP40_ERR_BUSY;
        return SGP40_ERR_BUSY;
    }
    if (hal_status != HAL_OK) {                        // Vraie erreur I2C (NACK, timeout HW...)
        ctx->hsgp40->last_hal_error = HAL_I2C_GetError(ctx->hi2c);
        ctx->hsgp40->consecutive_errors++;
        ctx->hsgp40->last_error = SGP40_ERR_I2C;
        ctx->state       = SGP40_ASYNC_ERROR;
        ctx->last_status = (hal_status == HAL_TIMEOUT) ? SGP40_ERR_TIMEOUT : SGP40_ERR_I2C;
        return ctx->last_status;
    }

    /* Transfert lancé — marque le handle comme occupé en async */
    ctx->hsgp40->async_busy              = 1U;
    ctx->state                           = SGP40_ASYNC_WRITE_CMD;
    ctx->i2c_deadline_ms                 = now_ms + ctx->hsgp40->i2c_timeout;
    ctx->last_status                     = SGP40_OK;
    ctx->hsgp40->measurement_mode_active = true;
    ctx->hsgp40->last_measure_tick_ms    = now_ms;

    return SGP40_OK;
}

/**
 * @brief Déclenche mesure VOC en mode IT (non-bloquant)
 */
SGP40_Status SGP40_ReadAll_IT(SGP40_Async_t *ctx) {
    if (!ctx || !ctx->hsgp40 || !ctx->hi2c) return SGP40_ERR_NULL_PTR;
    if (ctx->state != SGP40_ASYNC_IDLE) return SGP40_ERR_NOT_READY;

    SGP40_Status cfg_status = SGP40_Async_CheckConfig_IT(ctx);
    if (cfg_status != SGP40_OK) {
        ctx->state       = SGP40_ASYNC_ERROR;
        ctx->last_status = cfg_status;
        return cfg_status;
    }

    return SGP40_Async_TriggerMeasure_Common(ctx);
}

/**
 * @brief Machine d'état async — à appeler dans main loop
 */
void SGP40_Async_Process(SGP40_Async_t *ctx, uint32_t now_ms) {
    if (!ctx) return;

    // Délivrer les notifications utilisateur pendantes (déclenchées depuis les ISR)
    if (ctx->notify_data_pending && ctx->on_data_ready) {
        ctx->on_data_ready(ctx->user_ctx, ctx->voc_raw, ctx->last_status);
        ctx->notify_data_pending = false;
    }

    if (ctx->notify_error_pending && ctx->on_error) {
        ctx->on_error(ctx->user_ctx, ctx->last_status);
        ctx->notify_error_pending = false;
    }

    switch (ctx->state) {
        case SGP40_ASYNC_IDLE:
        case SGP40_ASYNC_DONE:
        case SGP40_ASYNC_ERROR:
            break;

        case SGP40_ASYNC_WRITE_CMD:                    // En attente du TxCplt I2C
            if ((int32_t)(now_ms - ctx->i2c_deadline_ms) >= 0) {  // Timeout I2C dépassé
                ctx->hsgp40->consecutive_errors++;
                ctx->hsgp40->last_error = SGP40_ERR_TIMEOUT;
                ctx->state              = SGP40_ASYNC_ERROR;
                ctx->last_status        = SGP40_ERR_TIMEOUT;
                ctx->error_flag         = true;
                ctx->notify_error_pending = true;
                ctx->hsgp40->async_busy = 0U;          // Libère le verrou : timeout = fin de transaction
            }
            break;

        case SGP40_ASYNC_WAIT_MEAS:                    // Attente délai mesure 30ms
            if ((int32_t)(now_ms - ctx->meas_deadline_ms) >= 0) {
                HAL_StatusTypeDef hal_status = HAL_I2C_Master_Receive_IT(
                    ctx->hi2c,
                    (uint16_t)(ctx->hsgp40->i2c_addr_7b << 1),
                    ctx->rx_buf, 3);

                if (hal_status == HAL_BUSY) {
                    // Bus occupé par un autre capteur : réessai dans SGP40_ASYNC_BUSY_RETRY_MS (multi-capteurs bus partagé)
                    // HAL_BUSY RX : async_busy reste à 1, on réessaiera
                    ctx->meas_deadline_ms = now_ms + SGP40_ASYNC_BUSY_RETRY_MS;
                } else if (hal_status != HAL_OK) {
                    ctx->hsgp40->last_hal_error = HAL_I2C_GetError(ctx->hi2c);
                    ctx->hsgp40->consecutive_errors++;
                    ctx->hsgp40->last_error = SGP40_ERR_I2C;
                    ctx->state              = SGP40_ASYNC_ERROR;
                    ctx->last_status        = (hal_status == HAL_TIMEOUT) ? SGP40_ERR_TIMEOUT : SGP40_ERR_I2C;
                    ctx->error_flag         = true;
                    ctx->notify_error_pending = true;
                    ctx->hsgp40->async_busy = 0U;      // Libère le verrou : erreur = fin de transaction
                } else {
                    ctx->state           = SGP40_ASYNC_READ_DATA;
                    ctx->i2c_deadline_ms = now_ms + ctx->hsgp40->i2c_timeout;
                }
            }
            break;

        case SGP40_ASYNC_READ_DATA:                    // En attente du RxCplt I2C
            if ((int32_t)(now_ms - ctx->i2c_deadline_ms) >= 0) {  // Timeout I2C dépassé
                ctx->hsgp40->consecutive_errors++;
                ctx->hsgp40->last_error = SGP40_ERR_TIMEOUT;
                ctx->state              = SGP40_ASYNC_ERROR;
                ctx->last_status        = SGP40_ERR_TIMEOUT;
                ctx->error_flag         = true;
                ctx->notify_error_pending = true;
                ctx->hsgp40->async_busy = 0U;          // Libère le verrou
            }
            break;
    }
    return;
}

/**
 * @brief Récupère dernière mesure VOC raw
 * @param ctx     Contexte async
 * @param voc_raw Pointeur pour stocker VOC raw
 * @retval SGP40_OK              si données valides (état DONE)
 * @retval SGP40_ERR_NULL_PTR    si ctx ou voc_raw est NULL
 * @retval SGP40_ERR_NOT_CONFIGURED si IDLE (aucune mesure lancée)
 * @retval SGP40_ERR_BUSY        si transfert en cours (état non-DONE, non-IDLE)
 * @retval ctx->last_status      si état ERROR (propage l'erreur réelle)
 * @note  Consomme la mesure et remet l'état à IDLE après lecture.
 */
SGP40_Status SGP40_Async_GetData(SGP40_Async_t *ctx, uint16_t *voc_raw) {
    if (!ctx || !voc_raw) return SGP40_ERR_NULL_PTR;

    if (ctx->state == SGP40_ASYNC_IDLE)  return SGP40_ERR_NOT_CONFIGURED;
    if (ctx->state == SGP40_ASYNC_ERROR) return ctx->last_status;
    if (ctx->state != SGP40_ASYNC_DONE)  return SGP40_ERR_BUSY;

    *voc_raw   = ctx->voc_raw;
    ctx->state = SGP40_ASYNC_IDLE;
    ctx->data_ready_flag     = false;
    ctx->notify_data_pending = false;

