TutoElectroWeb/STM32_SGP40/STM32_SGP40.c
    if (ctx->hsgp40) {
        ctx->hsgp40->async_busy = 0U;                 // Données consommées → libère le verrou
    }

    return ctx->last_status;
}

/**
 * @brief Callback HAL - Tx I2C terminé (mode IT)
 * @note  À appeler depuis HAL_I2C_MasterTxCpltCallback.
 *        Filtre sur hi2c : ignore si différent du handle configuré.
 */
void SGP40_Async_OnI2CMasterTxCplt(SGP40_Async_t *ctx, I2C_HandleTypeDef *hi2c) {
    if (!ctx || ctx->hi2c != hi2c) return;             // Filtre : ignore si handle I2C différent

    if (ctx->state == SGP40_ASYNC_WRITE_CMD) {
        // Commande + compensation envoyées, lancer temporisation SGP40_MEASURE_WAIT_MS avant lecture
        ctx->state            = SGP40_ASYNC_WAIT_MEAS;
        ctx->meas_deadline_ms = HAL_GetTick() + SGP40_MEASURE_WAIT_MS;
        // async_busy reste à 1 : on va lancer un RX ensuite
    }
}

/**
 * @brief Callback HAL - Rx I2C terminé (mode IT)
 * @note  À appeler depuis HAL_I2C_MasterRxCpltCallback.
 *        Filtre sur hi2c : ignore si différent du handle configuré.
 */
void SGP40_Async_OnI2CMasterRxCplt(SGP40_Async_t *ctx, I2C_HandleTypeDef *hi2c) {
    if (!ctx || ctx->hi2c != hi2c) return;             // Filtre : ignore si handle I2C différent

    if (ctx->state == SGP40_ASYNC_READ_DATA) {
        // Vérifier CRC du mot reçu
        uint8_t crc_calc = SGP40_CalculateCRC8(ctx->rx_buf, 2);
        if (crc_calc != ctx->rx_buf[2]) {              // CRC invalide : donnée corrompue
            ctx->hsgp40->consecutive_errors++;
            ctx->hsgp40->last_error = SGP40_ERR_CRC;
            ctx->state              = SGP40_ASYNC_ERROR;
            ctx->last_status        = SGP40_ERR_CRC;
            ctx->error_flag         = true;
            ctx->notify_error_pending = true;
            ctx->hsgp40->async_busy = 0U;              // Libère le verrou

            if (ctx->on_irq_error) {
                ctx->on_irq_error(ctx->irq_user_ctx);
            }
            return;
        }

        // Extraire VOC raw (2 octets utiles, CRC validé)
        ctx->voc_raw = (uint16_t)((ctx->rx_buf[0] << 8) | ctx->rx_buf[1]);
        ctx->hsgp40->last_voc_raw = ctx->voc_raw;
        ctx->hsgp40->measure_count++;
        ctx->hsgp40->consecutive_errors = 0;           // Mesure réussie : remet compteur à zéro

        ctx->state               = SGP40_ASYNC_DONE;
        ctx->last_status         = SGP40_OK;
        ctx->data_ready_flag     = true;
        ctx->notify_data_pending = true;
        // async_busy reste à 1 jusqu'à GetData() ou Reset()
        // (données disponibles mais pas encore consommées — polling toujours bloqué)

        if (ctx->on_irq_data_ready) {
            ctx->on_irq_data_ready(ctx->irq_user_ctx);
        }
    }
}

/**
 * @brief Callback HAL - Erreur I2C
 * @note  À appeler depuis HAL_I2C_ErrorCallback.
 *        Filtre sur hi2c : ignore si différent du handle configuré.
 */
void SGP40_Async_OnI2CError(SGP40_Async_t *ctx, I2C_HandleTypeDef *hi2c) {
    if (!ctx || ctx->hi2c != hi2c) return;             // Filtre : ignore si handle I2C différent

    ctx->hsgp40->consecutive_errors++;
    ctx->hsgp40->last_error    = SGP40_ERR_I2C;
    ctx->state                 = SGP40_ASYNC_ERROR;
    ctx->last_status           = SGP40_ERR_I2C;
    ctx->error_flag            = true;
    ctx->notify_error_pending  = true;
    ctx->hsgp40->async_busy    = 0U;                   // Erreur = fin de transaction HAL IT

    if (ctx->on_irq_error) {
        ctx->on_irq_error(ctx->irq_user_ctx);
    }
}

/* =============================================================================
 * Helpers haut niveau : Tick / TriggerEvery
 * ============================================================================= */

/**
 * @brief Avance la machine d'état async et retourne un résultat actionnable
 * @note  TICK_ERROR est émis UNIQUEMENT via ErrorFlag (vraie erreur HW : CRC, NACK,
 *        timeout). ERR_BUSY dans last_status (contention de bus normale sur bus
 *        partagé) ne déclenche PAS TICK_ERROR — la FSM reste IDLE et TriggerEvery
 *        retentera automatiquement au prochain cycle.
 */
SGP40_TickResult SGP40_Async_Tick(SGP40_Async_t *ctx, uint32_t now_ms, uint16_t *voc_raw_out) {
    if (!ctx) return SGP40_TICK_IDLE;

    SGP40_Async_Process(ctx, now_ms);
    /* Ne pas tester ctx->last_status ici : last_status == ERR_BUSY si HAL_BUSY
     * (contention de bus) — ce n'est pas une erreur → ne pas retourner TICK_ERROR. */

    if (SGP40_Async_ErrorFlag(ctx)) {                  // Vraie erreur HW uniquement
        SGP40_Async_ClearFlags(ctx);
        SGP40_Async_Reset(ctx);
        return SGP40_TICK_ERROR;
    }

    if (SGP40_Async_HasData(ctx)) {                    // Donnée prête
        uint16_t raw = 0U;
        SGP40_Async_GetData(ctx, &raw);
        SGP40_Async_ClearFlags(ctx);
        if (voc_raw_out) *voc_raw_out = raw;
        return SGP40_TICK_DATA_READY;
    }

    return SGP40_Async_IsIdle(ctx) ? SGP40_TICK_IDLE : SGP40_TICK_BUSY;
}

/**
 * @brief Déclenche ReadAll_IT() si IDLE && intervalle (stocké dans hsgp40) écoulé.
 *        Met à jour *last_ms uniquement si le trigger réussit.
 * @note  Compatible multi-capteurs : HAL_BUSY n'incrémente pas consecutive_errors.
 */
SGP40_Status SGP40_Async_TriggerEvery(SGP40_Async_t *ctx, uint32_t now_ms,
                                       uint32_t *last_ms) {
    if (!ctx || !last_ms) return SGP40_ERR_NULL_PTR;
    if ((now_ms - *last_ms) < ctx->hsgp40->sample_interval_ms) return SGP40_OK;  // Trop tôt
    if (!SGP40_Async_IsIdle(ctx)) return SGP40_ERR_BUSY;                          // FSM occupée

    SGP40_Status st = SGP40_ReadAll_IT(ctx);
    if (st == SGP40_OK) *last_ms = now_ms;
    return st;
}

/**
 * @brief Tick + calcul VOC Index en un seul appel.
 */
SGP40_TickResult SGP40_Async_TickIndex(SGP40_Async_t *ctx, uint32_t now_ms,
                                       uint16_t *voc_raw_out, uint16_t *voc_index_out) {
    if (!ctx || !voc_index_out) return SGP40_TICK_ERROR;

    uint16_t raw = 0U;
    SGP40_TickResult tick = SGP40_Async_Tick(ctx, now_ms, &raw);

    if (tick != SGP40_TICK_DATA_READY) return tick;

    if (voc_raw_out) *voc_raw_out = raw;

    SGP40_Status idx_status = SGP40_CalculateVOCIndex(ctx->hsgp40, raw, voc_index_out);
    if (idx_status != SGP40_OK) {
        ctx->last_status = idx_status;
        return SGP40_TICK_ERROR;
    }

    return SGP40_TICK_DATA_READY;
}
